[
  {
    "key": "article1",
    "title": "article1",
    "excerpt": "Analyzing Historical Homeopathic Literature\r\n\r\nThis programme systematizes classical sources (Kent, Boenninghausen, Hahnemann, Hughes) into clean tables for quantitative study.\r\nWe structure symptoms by Location, Sensation/Observation, Timing/Sequence, and Notes/Context to enable CSV/JSON exports and visual analytics.\r\n\r\nMethods include regex-first parsers with human-in-the-loop audit, FTS5-backed concordance alignment, and remedy–rubric bipartite graphs\r\nto explore signature strength and co-occurrence.",
    "icon": "book",
    "html": "<p>Analyzing Historical Homeopathic Literature</p>\n<p>This programme systematizes classical sources (Kent, Boenninghausen, Hahnemann, Hughes) into clean tables for quantitative study.\r\nWe structure symptoms by Location, Sensation/Observation, Timing/Sequence, and Notes/Context to enable CSV/JSON exports and visual analytics.</p>\n<p>Methods include regex-first parsers with human-in-the-loop audit, FTS5-backed concordance alignment, and remedy–rubric bipartite graphs\r\nto explore signature strength and co-occurrence.</p>"
  },
  {
    "key": "article2",
    "title": "Green Nanotechnology & Bioactivity",
    "excerpt": "Gold nanoparticles from Centella asiatica phenolics; antioxidant and anticholinesterase profiling.",
    "cover": "https://placehold.co/600x400/808000/FFFFFF?text=Nanotechnology",
    "icon": "flask",
    "html": "<p>Environment-friendly routes to AuNPs can interface with pharmacognosy and systems biology. We summarize synthesis,\r\ncharacterization, and in vitro bioactivity assays, linking results back to integrative therapeutics research.</p>"
  },
  {
    "key": "classical-homeopathy-revisited",
    "title": "Green Nanotechnology & Bioactivity",
    "excerpt": "Gold nanoparticles from Centella asiatica phenolics; antioxidant and anticholinesterase profiling.",
    "cover": "https://placehold.co/600x400/808000/FFFFFF?text=Homeopathic History",
    "icon": "history",
    "html": "<p>Why Revisit “Classical Homeopathy”? A Scholarly Reflection on Hahnemann and Kent</p>\n<ol>\n<li>Introduction: A Contemporary Spark\r\nIt began, not in an academic conference, nor in the quiet of a research library, but in the lively environment of a Facebook group dedicated to the study of homeopathy. The group administrator—a sincere and seasoned practitioner—posed a gentle but provocative question: “Why doesn’t classical homeopathy work?”\r\nIn response, I wrote a short but pointed comment:\r\n“Because it is nothing more than a myth in today’s world. People have distorted the original concept and replaced Hahnemann’s homeopathy with Kentian philosophy. In reality, either you practice Hahnemannian homeopathy or non-Hahnemannian.”\r\nThe comment was appreciated by the administrator, who reposted it as an invitation to further discussion. But the reactions that followed were mixed. Several members disagreed, and one respondent, in particular, expressed indignation:\r\n“I will never understand the hate that Dr. Kent gets. He was a great homeopath, and his contributions to our medical system are not only useful but reliable. I would be lost without his 12 observations …”\r\nHere lies the spark that gave rise to this book. The exchange revealed how deeply entrenched Kent’s philosophy has become in what many today call “classical homeopathy.” To critique Kent is, for some, to be seen as undermining the very edifice of homeopathy itself. Yet the issue is not about personal admiration or dislike. It is about historical fidelity, intellectual honesty, and scientific responsibility.\r\nThis book is not written to discredit Kent as a man or to deny his clinical efforts. Rather, it is an attempt to clarify the distinction between two very different streams: Hahnemann’s empirical, scientific homeopathy and Kent’s theological, metaphysical reinterpretation. To blur the two is to confuse generations of practitioners and to deepen the gulf between homeopathy and the wider scientific world.</li>\n</ol>\n<hr>\n<ol start=\"2\">\n<li>The Problem of “Classical Homeopathy”\r\nThe phrase “classical homeopathy” is of relatively recent origin. It is often used to describe the Kentian tradition, with its emphasis on high potencies, lengthy case-taking, and reliance on metaphysical constructs such as “the vital force as a spiritual influx.” But is this truly what “classical” means?\r\nIf by classical we mean the origins—the foundation laid down by Samuel Hahnemann—then Kent’s model is far from classical. Hahnemann’s Organon of Medicine (1810, with six editions revised by him until his death in 1843) outlines a method grounded in observable phenomena, reproducible experiments, and careful symptom analysis. In §6 of the Organon, Hahnemann insists:\r\n“The unprejudiced observer … takes note of nothing in every individual disease, except the changes in the health of the body and of the mind … perceived externally by means of the senses … These perceptible signs represent the disease in its whole extent …” [Organon, §6, 6th ed.]\r\nIn contrast, Kent, influenced by Emanuel Swedenborg’s mystical theology, argued in his Lectures on Homeopathic Philosophy that:\r\n“The internal man is prior to the external … The innermost is the will, and the outermost is the body. Between these two there is the understanding, and this is where influx acts …” [Kent, Lectures, Lecture II]\r\nSuch metaphysical language departs radically from Hahnemann’s demand for empirical grounding. The problem, then, is not that Kent was devoid of clinical insight, but that he redefined homeopathy through a theological lens, creating a hybrid that he and his followers presented as the authentic tradition.\r\nAn analogy from computer science is useful here: Hahnemann’s Organon is the source code, carefully written, debugged, and tested through clinical trials. Kent’s system, however, is like a forked version of the code, rewritten with metaphysical functions that cannot compile under scientific logic. To call Kent’s version “classical” is like calling a corrupted fork the original software.</li>\n</ol>\n<hr>\n<ol start=\"3\">\n<li>Hahnemann’s Scientific Homeopathy\r\nHahnemann was not a mystic recluse but a physician trained in the medical, chemical, and linguistic sciences of his time. His early fame came from his experiments detecting wine adulteration using chemical reagents. His translations of medical and chemical texts (such as Cullen’s Materia Medica) were marked by detailed footnotes, critical remarks, and experimental verifications.\r\nMost importantly, Hahnemann insisted on reproducibility. His experiments with cinchona bark, which led him to formulate the similia principle, were conducted repeatedly and compared with observations of other substances. Later, in The Chronic Diseases (1828), he expanded his theory by suggesting that chronic diseases are rooted in deep-seated miasms, particularly psora, which weaken the body’s defenses. Though his concept of “miasm” lacked the modern understanding of microbes, it was a serious attempt to provide a systematic, explanatory framework for chronic pathology.\r\nIn §3 of the Organon, Hahnemann describes the physician’s task with remarkable clarity:\r\n“If the physician clearly perceives what is to be cured in diseases … what is curative in medicines … and if he knows how to adapt … what is curative in medicines to what he has discovered to be undoubtedly morbid in the patient … then he understands how to treat judiciously and rationally, and he is a true practitioner of the healing art.” [Organon, §3]\r\nThis emphasis on perception, adaptation, and rationality reflects a proto-scientific mindset. Hahnemann was less concerned with metaphysical speculation and more with what today we might call “systems biology”: tracing the back-end logic (the deranged vital force) through the front-end outputs (the symptoms).\r\nAnalogy: In modern computing terms, Hahnemann treated the human organism as a program running on a vital operating system. Disease symptoms are the error messages or debug logs. The task of the physician is not to speculate on the unseen source code in abstract metaphysics, but to read the logs carefully, match them with remedy outputs (proving data), and resolve the bug.</li>\n</ol>\n<hr>\n<ol start=\"4\">\n<li>Kent’s Philosophical and Theological Turn\r\nJames Tyler Kent (1849–1916) came to homeopathy after a personal crisis in which his wife was cured by a homeopath. But his worldview was already deeply shaped by his devotion to Swedenborgian theology. Swedenborg (1688–1772), a Swedish mystic, taught that the material world is but a shadow of the spiritual, and that all true understanding flows from divine influx into the human soul.\r\nKent absorbed this framework wholesale. In his Lectures on Homeopathic Philosophy, he frequently invokes terms like “influx,” “interior man,” and “the correspondence of planes.” For example:\r\n“The body is the house in which the real man lives. The things that take place in the body are but outward representations of the internal man … Influx is from above, downwards; from within, outwards.” [Kent, Lectures, Lecture IV]\r\nThis language is not metaphorical flourish—it is theology. Kent explicitly dismissed the germ theory of disease, which was emerging with the works of Pasteur, Koch, and Lister. He argued instead that disease begins in the will and understanding, filtering down to the tissues. This position directly contradicted Hahnemann, who while speaking of “dynamic influences,” never denied the role of external agents. In The Chronic Diseases, Hahnemann carefully traced infectious miasms (psora, syphilis, sycosis) to external contagion, describing them as parasitic invasions that required meticulous observation and treatment.\r\nKent’s rejection of microbes placed homeopathy on a collision course with modern science. While bacteriology revolutionized medicine in the late 19th century, Kent’s followers entrenched themselves in metaphysics. The result was a widening gulf between homeopathy and the scientific mainstream.\r\nAnalogy: Imagine a programmer who insists that bugs in software are not caused by faulty code or external malware, but by “spiritual influences” entering the system. Such a view may inspire loyalty among believers but cannot withstand empirical testing.</li>\n</ol>\n<hr>\n<ol start=\"5\">\n<li>The Consequences of Kentian Dominance\r\nKent’s writings became the bedrock of “classical homeopathy” in the United States, and later in India and Europe. His repertory and his “12 observations” on remedy response are still taught widely. Yet, the dominance of his philosophy came at a cost:</li>\n<li>Detachment from science – While medicine embraced microbiology, pathology, and biochemistry, Kent’s school turned inward to metaphysics.</li>\n<li>Fragmentation – Later innovators, such as Rajan Sankaran with his “delusion method,” or Prafull Vijayakar with “genetic homeopathy,” extended speculative tendencies further. Each constructed a new model, not always grounded in provings or clinical reproducibility.</li>\n<li>Public perception – To outside observers, homeopathy seemed increasingly mystical, making it easier for critics to dismiss it as unscientific.\r\nAnalogy: Once the central database (Hahnemann’s materia medica and Organon) is corrupted, every new derivative inherits the corrupted fields. Instead of returning to the clean source, each school builds new patches, further away from the original structure.</li>\n</ol>\n<hr>\n<ol start=\"6\">\n<li>Reclaiming Hahnemann’s Vision\r\nThe task before us is not to vilify Kent but to restore balance. Hahnemann’s homeopathy was a work in progress, grounded in empirical method. His concept of miasms can today be reinterpreted in light of microbiology and immunology. Adler and Vithoulkas, in their respective works, have argued that Hahnemann’s “psora” can be seen as a metaphor for chronic infection, dysbiosis, or immune dysregulation.\r\nThus, reclaiming Hahnemann’s vision is not about nostalgia but about building a bridge between homeopathy and modern science. It means reading the Organon and Chronic Diseases not as mystical texts but as early attempts at systems-level medicine.\r\nAnalogy: Instead of running corrupted software patched by metaphysics, we return to the clean original code, align it with modern computational frameworks, and integrate it into contemporary practice.</li>\n</ol>\n<hr>\n<ol start=\"7\">\n<li>Conclusion: A Responsible Scholarship\r\nThis book begins, then, not with hostility but with responsibility. To clarify what is meant by “classical homeopathy,” to distinguish Hahnemann’s scientific empiricism from Kent’s theological metaphysics, and to re-open dialogue with the sciences of today.\r\nHahnemann’s Organon (§1) reminds us that the physician’s “high and only mission is to restore the sick to health, to cure.” Everything else—systems, philosophies, speculations—must be subordinate to this mission. Kent, despite his dedication, often placed theology above empirical science. That distinction must be clearly drawn if we are to honor homeopathy’s true founder.\r\nIn the next chapter, we will turn more closely to Hahnemann himself—his life, his experiments, and the scientific spirit that animated his reforms.</li>\n</ol>\n<hr>"
  },
  {
    "key": "article3",
    "title": "The Biochemical Basis of Homeopathic Principles",
    "excerpt": "Exploring regulatory hypotheses and dose–response phenomena as research questions, not conclusions.",
    "cover": "https://placehold.co/600x400/4B4B4B/FFFFFF?text=Biochemistry",
    "icon": "brain",
    "html": "<p>We outline candidate research questions at the interface of biochemistry and regulation biology relevant to small-signal responses,\r\nemphasizing careful framing, experimental reproducibility, and transparent reporting.</p>"
  }
]